backwards_step_tut/base_case/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    defaultFaces
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;    
    }

    "(front|back)"
    {
        type            empty;
    }

    "(upperWall|lowerWall)"    
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;    
    }
    
    "(lowerWallStartup|upperWallStartup)"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
