backwards_step_tut/base_case/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

rm log.*

runApplication blockMesh
runApplication rhoSimpleFoam

runApplication checkMesh -writeAllFields -latestTime -allTopology -allGeometry

# source $FOAM_RUN/.venv/bin/activate
# python3 postpro.py

touch p.foam

#------------------------------------------------------------------------------
